{
    "EMPTY": [
        "It looks like you haven't entered any text.",
        "I’m not sure what you wanted to say.",
        "There seems to be nothing here for me to respond to.",
        "Did you forget what you wanted to say? It happens to the best of us!",
        "Blank screens are my worst nightmare! Let's fill this one up.",
        "Well, that was an interestingly short message. Mind sharing more?"
    ],
    "NULL": [
        "Can you say that again?",
        "I'm not sure I quite understand.",
        "Please go on.",
        "I see.",
        "Tell me more about that.",
        "That's interesting.",
        "Why do you bring this up?",
        "It seems like we need a new topic of conversation. How about…? Oh wait, I can't decide either.",
        "Hmm, my processing power isn’t enough for this one. Mind if we switch to something simpler?",
        "That's a broad topic. Can you narrow it down for me?"
    ],
    "quit": {
        "weight": 0,
        "keywords": [
            "bye",
            "goodbye",
            "quit",
            "see you",
            "talk later",
            "exit"
        ],
        "responses": [
            "I understand if you need to go. It was nice talking with you.",
            "Thank you for chatting with me today! Feel free to come back anytime.",
            "If there’s anything else you’d like to talk about in the future, I’m here to help.",
            "If there's anything else on your mind in the future, I'd be happy to discuss it.",
            "I appreciate the time we spent together. Goodbye for now!",
            "Thanks for stopping by! Feel free to visit again when you need someone to talk to.",
            "Okay, okay, I get the hint. But remember, I’m always here for a chat if you need me.",
            "Well, that was quick! Don't hesitate to drop by again when you have more time.",
            "It looks like our conversation just ended abruptly. Let’s do it again sometime!"
        ]
    },
    "greetings": {
        "weight": 0,
        "decomp": "*",
        "keywords": [
            "hi",
            "hello",
            "hey"
        ],
        "responses": [
            "Nice to meet you!",
            "How can I help you?",
            "Greetings, traveller. What have you come to me for?"
        ]
    },
    "sorry": {
        "weight": 50,
        "decomp": "*",
        "keywords": [
            "sorry",
            "apologize"
        ],
        "responses": [
            "It's okay, I'm here to help.",
            "Apologies are unecessary.",
            "Let's unpack."
        ]
    }
}